integration/load_tests/all-scenarios.yml
config:
  defaults:
    headers:
      User-Agent: Artillery
  engines:
    playwright: {}
  phases:
    - duration: 15
      arrivalRate: 1
  plugins:
    apdex: {}
  processor: "./all-scenarios.js"
scenarios:
  - engine: playwright
    testFunction: "plan_a_trip_from_homepage"
  - engine: playwright
    testFunction: "plan_a_trip"
  - engine: playwright
    testFunction: "search_for_a_static_page"
  - engine: playwright
    testFunction: "search_for_a_station"
  - engine: playwright
    testFunction: "search_for_a_subway_line"
  - engine: playwright
    testFunction: "view_commuter_rail_schedule"
  - engine: playwright
    testFunction: "view_subway_schedule"
  - engine: playwright
    testFunction: "visit_a_static_page"
  - engine: playwright
    testFunction: "visit_the_homepage"